public/programming/gists/c/delta_time.c.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../gists.html">Gists</a> &gt;
</p>

<div id="outline-container-orga2e003f" class="outline-2">
<h2 id="orga2e003f">C / delta_time.c</h2>
<div class="outline-text-2" id="text-orga2e003f">
<p>
Calculate the frame delta time and render a certain number of times per seconds in C99.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">SPDX-License-Identifier: MIT
</span><span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Author: Giovanni Santini
</span><span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Github: @San7o
</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;time.h&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;assert.h&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;stdio.h&gt;</span>

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">void</span>)
{
  <span style="color: #98fb98;">double</span> <span style="color: #eedd82;">delta_time</span> = 0;
  <span style="color: #98fb98;">double</span> <span style="color: #eedd82;">fps</span> = 30;
  <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">timespec</span> <span style="color: #eedd82;">frame_start</span>, <span style="color: #eedd82;">frame_end</span>; 
  <span style="color: #00ffff;">while</span> (1) {
    clock_gettime(CLOCK_MONOTONIC, &amp;frame_start);

    <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Input...
</span>    <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Calculate...
</span>    <span style="color: #00ffff;">if</span> (delta_time &gt; 1 / fps)
    {
      delta_time = 0;

      printf(<span style="color: #ffa07a;">"Drawing!\n"</span>);
      <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Draw...
</span>    }

    clock_gettime(CLOCK_MONOTONIC, &amp;frame_end);
    <span style="color: #98fb98;">double</span> <span style="color: #eedd82;">diff</span> = (frame_end.tv_sec - frame_start.tv_sec)
      + (frame_end.tv_nsec - frame_start.tv_nsec) / 1e9;
    delta_time += diff;
  }
  <span style="color: #00ffff;">return</span> 0;
}
</pre>
</div>


<hr />

<p>
Travel: <a href="../gists.html">Gists</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
